Tekla Open API Reference for Tekla Structures 2025
BasePoint.Guid Property
 Gets or sets the guid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Guid Guid { get; set; }
Public Property Guid As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace